status/src/2022/0513.org
#+TITLE: 07 May 2022 - 13 May 2022

* MIT OCW
** 18.02 - Multiple Variable Calculus
*** Sessio 56-59
** 8.01X+8.01L - Physics I - Classical Mechanics with Labs
*** Started Problem Set 2
*** Planning experiment to measure 'g'
** 21G.701 Spanish
*** Finished Episodes 30-31 (no progress this week)
* Mill Controller #2
** Potential for using old Compaq iPaq boards.
** May use OLPC in the meantime.
** Still having problems with mill controller booting reliably.
   Needs a new RTC battery.
* OLPC
** Needs ML1120 coin batteries to fix "invalid system date".
* Virtual Orchestra
** Audio via liquidsfz (render-samples)
   "batch" renderer complete enough for first pass
** sfz file tests
   need to check existing sfz files and make new ones
* GAC
  Probably need to redo oscillators to tolerate zero frequency inputs
* Audio Distribution
  icecast setup seems to work, but is somewhat inconvenient to run
  between rooms. Otherwise considered done.
* Quilting Frame Desk
  Finished with tung oil and installed. Done!
* Intel i5
  Looking for a suitable motherboard and system. Reminds me why this is
  one of my least favorite activities.
* David Davies
** Broadcom BCG? Employee indicted for running a brothel.
** New case C1923172, consolidated with *15* Parties.
** Next hearing 9/6/2022
* Peter Kim
** Broadcom CSG Employee indicted for trade secret theft.
** United States v. Kim (5:21-cr-00438).
** Change of Plea Hearing set for 5/31/2022
