status/2022/0513.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>07 May 2022 - 13 May 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">07 May 2022 - 13 May 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org139e5d1">1. MIT OCW</a>
<ul>
<li><a href="#orga77d2e1">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#org5281e6f">1.1.1. Sessio 56-59</a></li>
</ul>
</li>
<li><a href="#org12221b9">1.2. 8.01X+8.01L - Physics I - Classical Mechanics with Labs</a>
<ul>
<li><a href="#org634c53b">1.2.1. Started Problem Set 2</a></li>
<li><a href="#org2901e49">1.2.2. Planning experiment to measure 'g'</a></li>
</ul>
</li>
<li><a href="#org317778a">1.3. 21G.701 Spanish</a>
<ul>
<li><a href="#org551bf7d">1.3.1. Finished Episodes 30-31 (no progress this week)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org769ab07">2. Mill Controller #2</a>
<ul>
<li><a href="#org5f93711">2.1. Potential for using old Compaq iPaq boards.</a></li>
<li><a href="#org977c826">2.2. May use OLPC in the meantime.</a></li>
<li><a href="#org0abe258">2.3. Still having problems with mill controller booting reliably.</a></li>
</ul>
</li>
<li><a href="#org8b62d2a">3. OLPC</a>
<ul>
<li><a href="#org587d565">3.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#orga63ea79">4. Virtual Orchestra</a>
<ul>
<li><a href="#org69d2a6c">4.1. Audio via liquidsfz (render-samples)</a></li>
<li><a href="#org9480ec3">4.2. sfz file tests</a></li>
</ul>
</li>
<li><a href="#orge1a37e3">5. GAC</a></li>
<li><a href="#org20d9f39">6. Audio Distribution</a></li>
<li><a href="#org5e928a0">7. Quilting Frame Desk</a></li>
<li><a href="#org50c44f2">8. Intel i5</a></li>
<li><a href="#orgd68403e">9. David Davies</a>
<ul>
<li><a href="#org9b09e26">9.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#org044c8cc">9.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#orgadf39d2">9.3. Next hearing 9/6/2022</a></li>
</ul>
</li>
<li><a href="#orgf1cfafa">10. Peter Kim</a>
<ul>
<li><a href="#org1432b79">10.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#org814e17a">10.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org622b11c">10.3. Change of Plea Hearing set for 5/31/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org139e5d1" class="outline-2">
<h2 id="org139e5d1"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga77d2e1" class="outline-3">
<h3 id="orga77d2e1"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org5281e6f" class="outline-4">
<h4 id="org5281e6f"><span class="section-number-4">1.1.1.</span> Sessio 56-59</h4>
</div>
</div>
<div id="outline-container-org12221b9" class="outline-3">
<h3 id="org12221b9"><span class="section-number-3">1.2.</span> 8.01X+8.01L - Physics I - Classical Mechanics with Labs</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org634c53b" class="outline-4">
<h4 id="org634c53b"><span class="section-number-4">1.2.1.</span> Started Problem Set 2</h4>
</div>
<div id="outline-container-org2901e49" class="outline-4">
<h4 id="org2901e49"><span class="section-number-4">1.2.2.</span> Planning experiment to measure 'g'</h4>
</div>
</div>
<div id="outline-container-org317778a" class="outline-3">
<h3 id="org317778a"><span class="section-number-3">1.3.</span> 21G.701 Spanish</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org551bf7d" class="outline-4">
<h4 id="org551bf7d"><span class="section-number-4">1.3.1.</span> Finished Episodes 30-31 (no progress this week)</h4>
</div>
</div>
</div>
<div id="outline-container-org769ab07" class="outline-2">
<h2 id="org769ab07"><span class="section-number-2">2.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5f93711" class="outline-3">
<h3 id="org5f93711"><span class="section-number-3">2.1.</span> Potential for using old Compaq iPaq boards.</h3>
</div>
<div id="outline-container-org977c826" class="outline-3">
<h3 id="org977c826"><span class="section-number-3">2.2.</span> May use OLPC in the meantime.</h3>
</div>
<div id="outline-container-org0abe258" class="outline-3">
<h3 id="org0abe258"><span class="section-number-3">2.3.</span> Still having problems with mill controller booting reliably.</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Needs a new RTC battery.
</p>
</div>
</div>
</div>
<div id="outline-container-org8b62d2a" class="outline-2">
<h2 id="org8b62d2a"><span class="section-number-2">3.</span> OLPC</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org587d565" class="outline-3">
<h3 id="org587d565"><span class="section-number-3">3.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-orga63ea79" class="outline-2">
<h2 id="orga63ea79"><span class="section-number-2">4.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org69d2a6c" class="outline-3">
<h3 id="org69d2a6c"><span class="section-number-3">4.1.</span> Audio via liquidsfz (render-samples)</h3>
<div class="outline-text-3" id="text-4-1">
<p>
"batch" renderer complete enough for first pass
</p>
</div>
</div>
<div id="outline-container-org9480ec3" class="outline-3">
<h3 id="org9480ec3"><span class="section-number-3">4.2.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-4-2">
<p>
need to check existing sfz files and make new ones
</p>
</div>
</div>
</div>
<div id="outline-container-orge1a37e3" class="outline-2">
<h2 id="orge1a37e3"><span class="section-number-2">5.</span> GAC</h2>
<div class="outline-text-2" id="text-5">
<p>
Probably need to redo oscillators to tolerate zero frequency inputs
</p>
</div>
</div>
<div id="outline-container-org20d9f39" class="outline-2">
<h2 id="org20d9f39"><span class="section-number-2">6.</span> Audio Distribution</h2>
<div class="outline-text-2" id="text-6">
<p>
icecast setup seems to work, but is somewhat inconvenient to run
between rooms. Otherwise considered done.
</p>
</div>
</div>
<div id="outline-container-org5e928a0" class="outline-2">
<h2 id="org5e928a0"><span class="section-number-2">7.</span> Quilting Frame Desk</h2>
<div class="outline-text-2" id="text-7">
<p>
Finished with tung oil and installed. Done!
</p>
</div>
</div>
<div id="outline-container-org50c44f2" class="outline-2">
<h2 id="org50c44f2"><span class="section-number-2">8.</span> Intel i5</h2>
<div class="outline-text-2" id="text-8">
<p>
Looking for a suitable motherboard and system. Reminds me why this is
one of my least favorite activities.
</p>
</div>
</div>
<div id="outline-container-orgd68403e" class="outline-2">
<h2 id="orgd68403e"><span class="section-number-2">9.</span> David Davies</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org9b09e26" class="outline-3">
<h3 id="org9b09e26"><span class="section-number-3">9.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-org044c8cc" class="outline-3">
<h3 id="org044c8cc"><span class="section-number-3">9.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-orgadf39d2" class="outline-3">
<h3 id="orgadf39d2"><span class="section-number-3">9.3.</span> Next hearing 9/6/2022</h3>
</div>
</div>
<div id="outline-container-orgf1cfafa" class="outline-2">
<h2 id="orgf1cfafa"><span class="section-number-2">10.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org1432b79" class="outline-3">
<h3 id="org1432b79"><span class="section-number-3">10.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-org814e17a" class="outline-3">
<h3 id="org814e17a"><span class="section-number-3">10.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org622b11c" class="outline-3">
<h3 id="org622b11c"><span class="section-number-3">10.3.</span> Change of Plea Hearing set for 5/31/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>